/*
Асинхронное программирование. Упражнение #1
1. Реализуйте функцию «countdown», которая принимает аргумент «int n» и печатает все числа от «n» до 0 с задержкой
   в одну секунду между каждым числом.
2. Затем вызовите «countdown(5)» внутри метода «main()» и убедитесь, что он работает должным образом.
3. Программа должна напечатать «Готово» после завершения обратного отсчета.
   При необходимости используйте «Future», «async» и «await».
Результат работы программы должен выглядеть следующим образом:
5
4
3
2
1
0
Готово
*/

Future<void> countdown(int n) async {
  print('Started');
  while (n >= 0) {
    await Future.delayed(Duration(seconds: 1), () => print(n));
    n--;
  }
  print('Completed');
}

Future<void> main() async {
  await countdown(5);
}